artillery/delete-api-zones-id.yml
# DELETE /api/zones/:id
# Requires: PERF_TOKEN_AUTHORIZED_PERSON, PERF_ZONE_ID

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "DELETE /api/zones/:id"
    flow:
      - delete:
          url: "/api/zones/{{ $environment.PERF_ZONE_ID }}"
          headers:
            Authorization: "Bearer {{ $environment.PERF_TOKEN_AUTHORIZED_PERSON }}"