artillery/get-api-docs.yml
# GET /api/docs — Swagger UI (HTML)

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "GET /api/docs"
    flow:
      - get:
          url: "/api/docs"