artillery/get-api-investigations-admin-all.yml
# GET /api/investigations/admin/all
# Requires: PERF_TOKEN_ADMIN

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "GET /api/investigations/admin/all"
    flow:
      - get:
          url: "/api/investigations/admin/all"
          headers:
            Authorization: "Bearer {{ $environment.PERF_TOKEN_ADMIN }}"