artillery/get-api-investigations-investigationid-notifications.yml
# GET /api/investigations/:investigationId/notifications
# Requires: PERF_TOKEN_ADMIN, PERF_INVESTIGATION_ID

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "GET /api/investigations/:investigationId/notifications"
    flow:
      - get:
          url: "/api/investigations/{{ $environment.PERF_INVESTIGATION_ID }}/notifications"
          headers:
            Authorization: "Bearer {{ $environment.PERF_TOKEN_ADMIN }}"