artillery/post-api-auth-signup.yml
# POST /api/auth/signup — PUBLIC_USER
# Processor sets unique signupEmail per VU.
# Requires: PERF_SIGNUP_PASSWORD in .env

config:
  target: "http://localhost:5000"
  http:
    timeout: 60
  processor: "./processors/common.js"

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "POST /api/auth/signup"
    flow:
      - function: "uniqueSignupEmail"
      - post:
          url: "/api/auth/signup"
          formData:
            name: "Perf User"
            email: "{{ signupEmail }}"
            phone: "0770000000"
            password: "{{ $environment.PERF_SIGNUP_PASSWORD }}"
            role: "PUBLIC_USER"