artillery/post-api-investigations-bulk-delete.yml
# POST /api/investigations/bulk-delete
# Requires: PERF_TOKEN_ADMIN

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "POST /api/investigations/bulk-delete"
    flow:
      - post:
          url: "/api/investigations/bulk-delete"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ $environment.PERF_TOKEN_ADMIN }}"
          json:
            investigationIds: []