artillery/post-api-investigations-start-reportid.yml
# POST /api/investigations/start/:reportId
# Requires: PERF_TOKEN_AUTHORIZED_PERSON, PERF_REPORT_ID

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "POST /api/investigations/start/:reportId"
    flow:
      - post:
          url: "/api/investigations/start/{{ $environment.PERF_REPORT_ID }}"
          headers:
            Authorization: "Bearer {{ $environment.PERF_TOKEN_AUTHORIZED_PERSON }}"