artillery/put-api-auth-profile.yml
# PUT /api/auth/profile — ZOOLOGIST
# Requires: PERF_TOKEN_ZOOLOGIST

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "PUT /api/auth/profile"
    flow:
      - put:
          url: "/api/auth/profile"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ $environment.PERF_TOKEN_ZOOLOGIST }}"
          json:
            phone: "0777777771"