artillery/put-api-reports-id.yml
# PUT /api/reports/:id
# Requires: PERF_TOKEN_PUBLIC_USER, PERF_REPORT_ID

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "PUT /api/reports/:id"
    flow:
      - put:
          url: "/api/reports/{{ $environment.PERF_REPORT_ID }}"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ $environment.PERF_TOKEN_PUBLIC_USER }}"
          json:
            description: "Updated via performance test description text."