artillery/put-api-species-id.yml
# PUT /api/species/:id
# Requires: PERF_TOKEN_ZOOLOGIST, PERF_SPECIES_ID

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 30
      arrivalRate: 3
      name: "steady"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 15000
      - http.response_time.p99: 25000
scenarios:
  - name: "PUT /api/species/:id"
    flow:
      - put:
          url: "/api/species/{{ $environment.PERF_SPECIES_ID }}"
          headers:
            Authorization: "Bearer {{ $environment.PERF_TOKEN_ZOOLOGIST }}"
          formData:
            fishes: '[{"scientificName":"Perf Sp.","localName":"Perf Upd","conservationStatus":"Endangered"}]'
            description: "Performance test species update description text."